Repository: Piero16301/Omni_Remote
Catalog: lib/l10n/arb/app_*.arb
Languages: es

# homeAppBarTitle
source: Home
es: Inicio

# homeNewGroupButton
source: New group
es: Nuevo grupo

# homeEmptyGroupsMessage
source: No groups saved, tap the button below to create a new group
es: No hay grupos guardados, presiona el bot칩n de abajo para crear un nuevo grupo

# homeGroupEmptyDevicesMessage
source: No devices in this group
es: No hay dispositivos en este grupo

# homeEditOption
source: Edit
es: Editar

# homeDeleteOption
source: Delete
es: Eliminar

# homeDeleteDialogTitle
source: Delete "{groupName}"?
es: 쮼liminar "{groupName}"?

# homeDeleteDialogContent
source: Are you sure you want to delete "{groupName}"? This action cannot be undone.
es: 쮼st치s seguro de que deseas eliminar "{groupName}"? Esta acci칩n no se puede deshacer.

# homeDeleteDialogCancel
source: Cancel
es: Cancelar

# homeDeleteDialogConfirm
source: Delete
es: Eliminar

# homeDeleteGroupSuccessSnackbar
source: Group deleted successfully
es: Grupo eliminado exitosamente

# homeDeleteGroupErrorNotEmpty
source: Cannot delete group because it contains devices
es: No se puede eliminar el grupo porque contiene dispositivos

# homeDeleteGroupErrorNotFound
source: Group not found
es: Grupo no encontrado

# homeDeleteGroupErrorUnknown
source: An unknown error occurred while deleting the group
es: Ocurri칩 un error desconocido al eliminar el grupo

# homeDeleteDeviceSuccessSnackbar
source: Device deleted successfully
es: Dispositivo eliminado exitosamente

# homeDeleteDeviceErrorNotFound
source: Device not found
es: Dispositivo no encontrado

# homeDeleteDeviceErrorUnknown
source: An unknown error occurred while deleting the device
es: Ocurri칩 un error desconocido al eliminar el dispositivo

# modifyGroupPageTitleEdit
source: Edit group
es: Editar grupo

# modifyGroupPageTitleCreate
source: New group
es: Nuevo grupo

# modifyGroupTitleLabel
source: Title
es: T칤tulo

# modifyGroupTitleHint
source: E.g., Living Room
es: Ej., Sala de estar

# modifyGroupTitleErrorEmpty
source: Title cannot be empty
es: El t칤tulo no puede estar vac칤o

# modifyGroupTitleErrorInvalidFormat
source: Title can only contain letters and numbers
es: El t칤tulo solo puede contener letras y n칰meros

# modifyGroupTitleErrorMultipleSpaces
source: Title cannot contain multiple consecutive spaces
es: El t칤tulo no puede contener m칰ltiples espacios consecutivos

# modifyGroupSubtitleLabel
source: Subtitle (optional)
es: Subt칤tulo (opcional)

# modifyGroupSubtitleHint
source: E.g., Lights and TV
es: Ej., Luces y TV

# modifyGroupSelectIcon
source: Select Icon
es: Seleccionar 칤cono

# modifyGroupPreview
source: Preview
es: Vista previa

# modifyGroupGroupTitle
source: Group title
es: T칤tulo del grupo

# modifyGroupGroupSubtitle
source: Group subtitle
es: Subt칤tulo del grupo

# modifyGroupSaveSuccessSnackbar
source: Group "{groupName}" saved successfully
es: Grupo "{groupName}" guardado exitosamente

# modifyGroupSaveDefaultError
source: Failed to save group "{groupName}", please try again
es: Error al guardar el grupo "{groupName}", por favor intenta de nuevo

# modifyGroupSaveDuplicateError
source: A group with the name "{groupName}" already exists
es: Ya existe un grupo con el nombre "{groupName}"

# modifyDevicePageTitleEdit
source: Edit device
es: Editar dispositivo

# modifyDevicePageTitleCreate
source: New device
es: Nuevo dispositivo

# modifyDeviceTitleLabel
source: Title
es: T칤tulo

# modifyDeviceTitleHint
source: E.g., Main Light
es: Ej., Luz Principal

# modifyDeviceTitleErrorEmpty
source: Title cannot be empty
es: El t칤tulo no puede estar vac칤o

# modifyDeviceTitleErrorInvalidFormat
source: Title can only contain letters and numbers
es: El t칤tulo solo puede contener letras y n칰meros

# modifyDeviceTitleErrorMultipleSpaces
source: Title cannot contain multiple consecutive spaces
es: El t칤tulo no puede contener m칰ltiples espacios consecutivos

# modifyDeviceSubtitleLabel
source: Subtitle (optional)
es: Subt칤tulo (opcional)

# modifyDeviceSubtitleHint
source: E.g., Living room ceiling
es: Ej., Techo de la sala

# modifyDeviceSelectIcon
source: Select Icon
es: Seleccionar 칤cono

# modifyDeviceSelectGroup
source: Select Group
es: Seleccionar grupo

# modifyDeviceGroupLabel
source: Group
es: Grupo

# modifyDeviceGroupHint
source: Select a group
es: Selecciona un grupo

# modifyDeviceNoGroup
source: No group
es: Sin grupo

# modifyDeviceTileTypeLabel
source: Device Type
es: Tipo de dispositivo

# modifyDeviceTileTypeBoolean
source: Boolean
es: Booleano

# modifyDeviceTileTypeNumber
source: Number
es: N칰mero

# modifyDeviceRangeConfigurationLabel
source: Range Configuration
es: Configuraci칩n de rango

# modifyDeviceRangeMinLabel
source: Minimum Value
es: Valor m칤nimo

# modifyDeviceRangeMinHint
source: E.g., 0
es: Ej., 0

# modifyDeviceRangeMaxLabel
source: Maximum Value
es: Valor m치ximo

# modifyDeviceRangeMaxHint
source: E.g., 100
es: Ej., 100

# modifyDeviceDivisionsLabel
source: Divisions
es: Divisiones

# modifyDeviceDivisionsHint
source: E.g., 10
es: Ej., 10

# modifyDeviceIntervalLabel
source: Interval
es: Intervalo

# modifyDeviceIntervalHint
source: E.g., 5
es: Ej., 5

# modifyDeviceRangeErrorEmpty
source: This field cannot be empty
es: Este campo no puede estar vac칤o

# modifyDeviceRangeErrorInvalid
source: Please enter a valid number
es: Por favor ingresa un n칰mero v치lido

# modifyDeviceRangeMinMaxError
source: Minimum value must be less than maximum value
es: El valor m칤nimo debe ser menor que el valor m치ximo

# modifyDevicePreview
source: Preview
es: Vista previa

# modifyDeviceDeviceTitle
source: Device title
es: T칤tulo del dispositivo

# modifyDeviceDeviceSubtitle
source: Device subtitle
es: Subt칤tulo del dispositivo

# modifyDeviceSaveSuccessSnackbar
source: Device "{deviceName}" saved successfully
es: Dispositivo "{deviceName}" guardado exitosamente

# modifyDeviceSaveDefaultError
source: Failed to save device "{deviceName}", please try again
es: Error al guardar el dispositivo "{deviceName}", por favor intenta de nuevo

# modifyDeviceSaveDuplicateError
source: A device with the name "{deviceName}" already exists in the group "{groupName}"
es: Ya existe un dispositivo con el nombre "{deviceName}" en el grupo "{groupName}"

# modifyDeviceSaveNoGroupSelectedError
source: Please select a group for the device
es: Por favor selecciona un grupo para el dispositivo

# modifyDeviceMqttTopics
source: MQTT Topics
es: T칩picos MQTT

# modifyDeviceMqttTopicOnline
source: Online
es: En l칤nea

# modifyDeviceMqttTopicStatus
source: Status
es: Estado

# modifyDeviceMqttTopicCommand
source: Command
es: Comando

# modifyDeviceMqttSnackbarCopy
source: MQTT topic for "{topicType}" copied to clipboard
es: T칩pico MQTT para "{topicType}" copiado al portapapeles

# modifyDeviceMqttTopicOnlineDescription
source: Receives "0" when the device is disconnected and "1" when connected.
es: Recibe "0" cuando el dispositivo est치 desconectado y "1" cuando est치 conectado.

# modifyDeviceMqttTopicStatusDescriptionBool
source: Receives the current state of the device, "0" for off and "1" for on.
es: Recibe el estado actual del dispositivo, "0" para apagado y "1" para encendido.

# modifyDeviceMqttTopicCommandDescriptionBool
source: Sends "0" to turn off the device and "1" to turn it on.
es: Env칤a "0" para apagar el dispositivo y "1" para encenderlo.

# modifyDeviceMqttTopicStatusDescriptionNumber
source: Receives the current value of the device within the configured range (e.g., "3.5").
es: Recibe el valor actual del dispositivo dentro del rango configurado (Ej., "3.5").

# modifyDeviceMqttTopicCommandDescriptionNumber
source: Sends a value within the configured range to adjust the device (e.g., "7.3").
es: Env칤a un valor dentro del rango configurado para ajustar el dispositivo (Ej., "7.3").

# settingsAppBarTitle
source: Settings
es: Ajustes

# settingsLanguageTitle
source: Language
es: Idioma

# settingsLanguageEnglish
source: English
es: 游쥟릖 Ingl칠s

# settingsLanguageSpanish
source: Spanish
es: 游쀯릖 Espa침ol

# settingsThemeTitle
source: Theme
es: Tema

# settingsThemeLight
source: Light
es: Claro

# settingsThemeDark
source: Dark
es: Oscuro

# settingsBaseColorTitle
source: Base color
es: Color base

# settingsColorRed
source: Red
es: Rojo

# settingsColorPink
source: Pink
es: Rosa

# settingsColorPurple
source: Purple
es: Morado

# settingsColorDeepPurple
source: Deep purple
es: P칰rpura profundo

# settingsColorIndigo
source: Indigo
es: 칈ndigo

# settingsColorBlue
source: Blue
es: Azul

# settingsColorLightBlue
source: Light blue
es: Azul claro

# settingsColorCyan
source: Cyan
es: Cian

# settingsColorTeal
source: Teal
es: Verde azulado

# settingsColorGreen
source: Green
es: Verde

# settingsColorLightGreen
source: Light green
es: Verde claro

# settingsColorLime
source: Lime
es: Lima

# settingsColorYellow
source: Yellow
es: Amarillo

# settingsColorAmber
source: Amber
es: 츼mbar

# settingsColorOrange
source: Orange
es: Naranja

# settingsColorDeepOrange
source: Deep orange
es: Naranja profundo

# settingsColorBrown
source: Brown
es: Marr칩n

# settingsColorGrey
source: Grey
es: Gris

# settingsColorBlueGrey
source: Blue grey
es: Gris azulado
